#+BEGIN_COMMENT
.. title: Logging, Summaries, and Saving Graphs
.. slug: logging-multiple-graphs-summaries-and-saving-graphs
.. date: 2018-05-29 14:30:05 UTC-07:00
.. tags: tensorflow dummies
.. category: TensorFlow
.. link: 
.. description: How to use logging, summarize graphs and save them.
.. type: text
#+END_COMMENT

This is based on *TensorFlow for Dummies* and the TensorFlow documentation.

* What is this about?
  This will demonstrate serveral things that might be commonly useful:

  - How to use logging
  - How to create multiple graphs
  - How to summarize graphs
  - How to save graphs to a file

#+BEGIN_SRC ipython :session dummies
import tensorflow
#+END_SRC

#+RESULTS:
: # Out[1]:

* Okay, but how do you use this?
  You run this in a session.

#+BEGIN_SRC ipython :session dummies :exports both :results output
with tensorflow.Session() as session:
    # run the session
    outcome, summary = session.run([dot_product, merged])

    # log the outcome
    tensorflow.logging.info("Dot Product: %s", outcome)

    # print the summary
    writer.add_summary(summary)

    # force it to dump now
    writer.flush()

    # Save the graph
    tensorflow.train.write_graph(session.graph, "/tmp/tensorlog", 'graph_1.dat')
#+END_SRC

#+RESULTS:
: INFO:tensorflow:Dot Product: -77.974

